import { configureStore, createSlice } from '@reduxjs/toolkit'

let 부서info = createSlice({
  name : '부서info',
  initialState : [
    {id: 1, dep: '영유아2부', ministry: '우덕인전도사', all_num: '21'},
    {id: 2, dep: '영유아3부', ministry: '우덕인전도사', all_num: '31'},
    {id: 3, dep: '유치2부', ministry: '이송혜전도사', all_num: '34'}, 
    {id: 4, dep: '유치3부', ministry: '이송혜전도사', all_num: '61'},
    {id: 5, dep: '유년2부', ministry: '조효정전도사', all_num: '50'},
    {id: 6, dep: '유년3부', ministry: '조효정전도사', all_num: '98'},
    {id: 7, dep: '초등2부', ministry: '이효복목사', all_num: '79'},
    {id: 8, dep: '초등3부', ministry: '이효복목사', all_num: '121'},
    {id: 9, dep: '중등부', ministry: '김예찬강도사', all_num: '139'}, 
    {id: 10, dep: '고등부', ministry: '이요한목사', all_num: '87'}
  ]
})  

let 각부서학년 = createSlice({
  name : '각부서학년',
  initialState : [
  {1 : '1~2', 2: '3', 3: '4'},
  {1 : '2', 2: '3', 3: '4'},
  {1 : '5', 2: '6', 3: '7'},
  {1 : '5', 2: '6', 3: '7'},
  {1 : '1', 2: '2', 3: '3'},
  {1 : '1', 2: '2', 3: '3'},
  {1 : '4', 2: '5', 3: '6'},
  {1 : '4', 2: '5', 3: '6'},
  {1 : '1', 2: '2', 3: '3'},
  {1 : '1', 2: '2', 3: '3'},
  ]
})  

let 각부서반 = createSlice({
  name : '각부서반',
  initialState : [
  {1 : '사랑', 2: '희락', 3: '화평', 4: '자비', 5: '양선', 6: '', 7: '', 8: '', 9: ''},
  {1 : '노아', 2: '여호수아', 3: '모세', 4: '다윗', 5: '요셉', 6: '새가족', 7: '', 8: '', 9: ''},
  {1 : '여호수아', 2: '베드로', 3: '다니엘', 4: '다윗', 5: '솔로몬', 6: '아브라함', 7: '노아', 8: '요셉', 9: ''},
  {1 : '펭귄', 2: '돌고래', 3: '코끼리', 4: '호랑이', 5: '백곰', 6: '사자', 7: '하마', 8: '기린', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '', 6: '', 7: '', 8: '', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '', 7: '', 8: '', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '', 6: '', 7: '', 8: '', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '', 7: '', 8: '', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '6', 7: '7', 8: '', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '6', 7: '', 8: '', 9: ''}
  ]
})

let 각부서재적 = createSlice({
  name : '각부서재적',
  initialState : [
  '21', '31', '34', '61', '50', '98', '79', '121', '139', '87'
  ]
})


export default configureStore({
  reducer: {
    부서info : 부서info.reducer,
    각부서반 : 각부서반.reducer,
    각부서학년 : 각부서학년.reducer,
    각부서재적 : 각부서재적.reducer
  }
}) 