import { configureStore, createSlice } from '@reduxjs/toolkit'

let 부서info = createSlice({
  name : '부서info',
  initialState : [
    {id: 1, dep: '영유아2부', ministry: '우덕인전도사', all_num: '21'},
    {id: 2, dep: '영유아3부', ministry: '우덕인전도사', all_num: '31'},
    {id: 3, dep: '유치2부', ministry: '이송혜전도사', all_num: '34'}, 
    {id: 4, dep: '유치3부', ministry: '이송혜전도사', all_num: '61'},
    {id: 5, dep: '유년2부', ministry: '조효정전도사', all_num: '50'},
    {id: 6, dep: '유년3부', ministry: '조효정전도사', all_num: '98'},
    {id: 7, dep: '초등2부', ministry: '이효복목사', all_num: '79'},
    {id: 8, dep: '초등3부', ministry: '이효복목사', all_num: '121'},
    {id: 9, dep: '중등부', ministry: '김예찬강도사', all_num: '139'}, 
    {id: 10, dep: '고등부', ministry: '이요한목사', all_num: '87'}
  ]
})  

let 각부서학년 = createSlice({
  name : '각부서학년',
  initialState : [
  {id: 1, 1 : '1~2', 2: '3', 3: '4'},
  {id: 2, 1 : '1~2', 2: '3', 3: '4'},
  {id: 3, 1 : '2부', 2: '', 3: ''},
  {id: 4, 1 : '3부', 2: '', 3: ''},
  {id: 5, 1 : '1', 2: '2', 3: '3'},
  {id: 6, 1 : '1', 2: '2', 3: '3'},
  {id: 7, 1 : '4', 2: '5', 3: '6'},
  {id: 8, 1 : '4', 2: '5', 3: '6'},
  {id: 9, 1 : '1', 2: '2', 3: '3'},
  {id: 10, 1 : '고등', 2: '', 3: ''},
  ]
})  

let 각부서반 = createSlice({
  name : '각부서반',
  initialState : [
  {id: 1, 1 : '이삭', 2: '요셉', 3: '야곱', 4: '다니엘', 5: '다윗', 6: '새가족', 7: '', 8: '', 9: '', 10: '', 11:''},
  {id: 2, 1 : '디모데', 2: '요한', 3: '누가', 4: '마태', 5: '마가', 6: '새가족', 7: '', 8: '', 9: '', 10: '', 11:''},
  {id: 3, 1 : '노아', 2: '요셉', 3: '아브라함', 4: '다윗', 5: '여호수아', 6: '솔로몬', 7: '다니엘', 8: '베드로', 9: '', 10: '', 11:''},
  {id: 4, 1 : '하마', 2: '호랑이', 3: '코끼리', 4: '백곰', 5: '펭귄', 6: '돌고래', 7: '사자', 8: '기린', 9: '토끼', 10: '코알라', 11:''},
  {id: 5, 1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '6', 7: '7', 8: '', 9: '', 10: '추후배정', 11:'새가족'},
  {id: 6, 1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '6', 7: '7', 8: '', 9: '', 10: '추후배정', 11:'새가족'},
  {id: 7, 1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '6', 7: '7', 8: '', 9: '', 10: '', 11:'새가족'},
  {id: 8, 1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '6', 7: '7', 8: '', 9: '', 10: '', 11:'새가족'},
  {id: 9, 1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '6', 7: '7', 8: '', 9: '', 10: '', 11:'새가족'},
  {id: 10, 1 : '장우영', 2: '이상재', 3: '임찬희', 4: '김은경', 5: '손혜영', 6: '곽지수', 7: '손창숙', 8: '임수현', 9: '장준수', 10: '윤경원', 11:'천은숙'},
  ]
})

let 각부서재적 = createSlice({
  name : '각부서재적',
  initialState : [
  '21', '31', '34', '61', '50', '98', '79', '121', '139', '87'
  ]
})


export default configureStore({
  reducer: {
    부서info : 부서info.reducer,
    각부서반 : 각부서반.reducer,
    각부서학년 : 각부서학년.reducer,
    각부서재적 : 각부서재적.reducer
  }
}) 