import { configureStore, createSlice } from '@reduxjs/toolkit'

let 부서이름 = createSlice({
  name : '부서이름',
  initialState : [
    '영유아2부', '영유아3부', 
    '유치2부', '유치3부', 
    '유년2부', '유년3부', 
    '초등2부', '초등3부', 
    '중등부', '고등부'
  ]
})


let 사역자 = createSlice({
  name : '사역자',
  initialState : [
  '우덕인전도사', '우덕인전도사', 
  '이송혜전도사', '이송혜전도사', 
  '조효정전도사', '조효정전도사', 
  '이효복목사', '이효복목사', 
  '김예찬전도사', '이요한목사'
  ]
})



let 각부서학년 = createSlice({
  name : '각부서학년',
  initialState : [
  {1 : '1~2', 2: '3', 3: '4'},
  {1 : '2', 2: '3', 3: '4'},
  {1 : '5', 2: '6', 3: '7'},
  {1 : '5', 2: '6', 3: '7'},
  {1 : '1', 2: '2', 3: '3'},
  {1 : '1', 2: '2', 3: '3'},
  {1 : '4', 2: '5', 3: '6'},
  {1 : '4', 2: '5', 3: '6'},
  {1 : '1', 2: '2', 3: '3'},
  {1 : '1', 2: '2', 3: '3'},
  ]
})  

let 각부서반 = createSlice({
  name : '각부서반',
  initialState : [
  {1 : '사랑', 2: '희락', 3: '화평', 4: '자비', 5: '양선', 6: '', 7: '', 8: '', 9: ''},
  {1 : '노아', 2: '여호수아', 3: '모세', 4: '다윗', 5: '요셉', 6: '새가족', 7: '', 8: '', 9: ''},
  {1 : '여호수아', 2: '베드로', 3: '다니엘', 4: '다윗', 5: '솔로몬', 6: '아브라함', 7: '노아', 8: '요셉', 9: ''},
  {1 : '펭귄', 2: '돌고래', 3: '코끼리', 4: '호랑이', 5: '백곰', 6: '사자', 7: '하마', 8: '기린', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '', 6: '', 7: '', 8: '', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '', 7: '', 8: '', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '', 6: '', 7: '', 8: '', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '', 7: '', 8: '', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '6', 7: '7', 8: '', 9: ''},
  {1 : '1', 2: '2', 3: '3', 4: '4', 5: '5', 6: '6', 7: '', 8: '', 9: ''}
  ]
})

let 각부서재적 = createSlice({
  name : '각부서재적',
  initialState : [
  '21', '31', '34', '61', '50', '98', '79', '121', '139', '87'
  ]
})



let 일요일 = createSlice({
  name : '일요일',
  initialState : [
    `1
/
1`, `1
/
8`, `1
/
15`, `1
/
22`, `1
/
29`, 
    `2
/
5`, `2
/
12`, `2
/
19`, `2
/
26`, 
    `3
/
5`, `3
/
12`, `3
/
19`, `3
/
26`, 
    `4
/
2`, `4
/
9`, `4
/
16`, `4
/
23`, `4
/
30`, 
    `5
/
7`, `5
/
14`, `5
/
21`, `5
/
28`, 
    `6
/
4`, `6
/
11`, `6
/
18`, `6
/
25`, 
    `7
/
2`, `7
/
9`, `7
/
16`, `7
/
23`, `7
/
30`, 
    `8
/
6`, `8
/
13`, `8
/
20`, `8
/
27`, 
    `9
/
3`, `9
/
10`, `9
/
17`, `9
/
24`, 
    `10
/
1`, `10
/
8`, `10
/
15`, `10
/
22`, `10
/
29`, 
    `11
/
5`, `11
/
12`, `11
/
19`, `11
/
26`, 
    `12
/
3`, `12
/
10`, `12
/
17`, `12
/
24`, `12
/
31`
  ]
})



export default configureStore({
  reducer: {
    일요일 : 일요일.reducer,
    부서이름 : 부서이름.reducer,
    사역자 : 사역자.reducer,
    각부서반 : 각부서반.reducer,
    각부서학년 : 각부서학년.reducer,
    각부서재적 : 각부서재적.reducer
  }
}) 