let Basicdepmain = [
  {"dn": "dep1", "dn_ko": "영유아2부", "dan": "1-1", "dan_ko": "1~2세", "dgn" : "1-1-1", "dgn_ko" : "1~2세첫번째반"},
  {"dn": "dep1", "dn_ko": "영유아2부", "dan": "1-1", "dan_ko": "1~2세", "dgn" : "1-1-2", "dgn_ko" : "1~2세두번째반"},
  {"dn": "dep1", "dn_ko": "영유아2부", "dan": "1-2", "dan_ko": "3세", "dgn" : "1-2-1", "dgn_ko" : "3세첫번째반"},
  {"dn": "dep1", "dn_ko": "영유아2부", "dan": "1-2", "dan_ko": "3세", "dgn" : "1-2-2", "dgn_ko" : "3세두번째반"},
  {"dn": "dep1", "dn_ko": "영유아2부", "dan": "1-3", "dan_ko": "4세", "dgn" : "1-3-1", "dgn_ko" : "4세첫번째반"},
  {"dn": "dep1", "dn_ko": "영유아2부", "dan": "1-3", "dan_ko": "4세", "dgn" : "1-3-2", "dgn_ko" : "4세두번째반"},
  {"dn": "dep2", "dn_ko": "영유아3부", "dan": "2-1", "dan_ko": "1~2세", "dgn" : "2-1-1", "dgn_ko" : "1~2세첫번째반"},
  {"dn": "dep2", "dn_ko": "영유아3부", "dan": "2-1", "dan_ko": "1~2세", "dgn" : "2-1-2", "dgn_ko" : "1~2세두번째반"},
  {"dn": "dep2", "dn_ko": "영유아3부", "dan": "2-2", "dan_ko": "3세", "dgn" : "2-2-1", "dgn_ko" : "3세첫번째반"},
  {"dn": "dep2", "dn_ko": "영유아3부", "dan": "2-2", "dan_ko": "3세", "dgn" : "2-2-2", "dgn_ko" : "3세두번째반"},
  {"dn": "dep2", "dn_ko": "영유아3부", "dan": "2-3", "dan_ko": "4세", "dgn" : "2-3-1", "dgn_ko" : "4세첫번째반"},
  {"dn": "dep2", "dn_ko": "영유아3부", "dan": "2-3", "dan_ko": "4세", "dgn" : "2-3-2", "dgn_ko" : "4세두번째반"},
  {"dn": "dep3", "dn_ko": "유치2부", "dan": "3-1", "dan_ko": "5세", "dgn" : "3-1-1", "dgn_ko" : "5세첫번째반"},
  {"dn": "dep3", "dn_ko": "유치2부", "dan": "3-1", "dan_ko": "5세", "dgn" : "3-1-2", "dgn_ko" : "5세두번째반"},
  {"dn": "dep3", "dn_ko": "유치2부", "dan": "3-2", "dan_ko": "6세", "dgn" : "3-3-1", "dgn_ko" : "6세첫번째반"},
  {"dn": "dep3", "dn_ko": "유치2부", "dan": "3-2", "dan_ko": "6세", "dgn" : "3-3-2", "dgn_ko" : "6세두번째반"},
  {"dn": "dep3", "dn_ko": "유치2부", "dan": "3-3", "dan_ko": "7세", "dgn" : "3-3-1", "dgn_ko" : "7세첫번째반"},
  {"dn": "dep3", "dn_ko": "유치2부", "dan": "3-3", "dan_ko": "7세", "dgn" : "3-3-2", "dgn_ko" : "7세두번째반"},

]

export default Basicdepmain;
